;*******************************************************************************************
;  FILE:   Psionics Ex Machina. int                                 
;  
;	File created	25/07/20    21:00
;	LAST UPDATED    26/04/23    18:30
;
;*******************************************************************************************

;========================================================
;   ADJUSTMENTS TO BASE GAME TECH DESCRIPTIONS
;========================================================

[Psionics X2TechTemplate]
DisplayName="“灵能之神计划”（Psionics Ex Machina）"
Summary="虽然我们曾见过他们使用灵能，但我们最近与外星人的接触才真正向我们展示了他们如何巧妙地操纵灵能力量，并将其转化为自己的优势。如果我们能像他们一样掌握它，这个领域的潜在应用将是无限的。我们需要更多的实验。"
CodeName="克洛伊斯塔.盖勒"
LongDescription="通过仔细研究外星人利用和使用灵能的方法，我相信我们会有足够的灵能士兵候选人，但是我们已经从各种外星物种身上看到了强大的灵能力量，所以这可能还不够。为了新兵种的研究，我已经用从指挥官身上取下的芯片研究了聚焦和转移灵能能量所需的技术。结合对变种人祭司所使用的灵能增幅器的分析，我能通过逆向工程创造出XCOM自己的灵能增幅器。\n\n然而，即使在强大的灵能候选人手中，现在的灵能增幅器也被证明效果不足。\n\n随着时间的推移，外星人入侵所带来的原石已经开始惰性化，变成结晶。我们发现了它的新形态，看起来就像宝石。我们从一个已经生锈的旧设施里的文件中了解到，这种物质已经与失落地区的失魂者融合，我们可以从失魂者身上收获这种物质。我把这种新形式称为“宝石般的能量融合（Gemlike Energised Meld）”（灵能石(GEM)）。这纯粹是一个偶然的发现，但这种物质似乎对我们的灵能增幅器有强烈的反应，所以这会是我们获得灵能的新方法。我还意识到灵能石是灵能的完美导体，可以直接插入我们的灵能增幅器。其中一些灵能石将变得非常不稳定，需要进一步的限制措施。值得庆幸的是，将灵能石嵌入个人战斗接口并直接接入我们士兵的心灵是稳定这些强大灵能的好方法。\n\n虽然可能会有不小的副作用，但我可以预见，我们的士兵有能力将他们的新力量拓展到我们认为的安全范围之外。使用灵能对大多数人来说是一种精神负担，但圣殿骑士似乎可以毫不费力地使用它们。这些还需要实际测试，指挥官\n\n理查德·泰根"

;Gyrationally = 以圆形或螺旋形的方式运动，传达出一种充满能量和活力的状态
;Exoteric = 不局限于内部弟子或入门者的圈子。为公众所能理解或适合公众的；通俗的。与外部相关的；外在的. 

;========================================================
;   ADJUSTMENTS TO BASE GAME ITEM DESCRIPTIONS
;========================================================

[PsiAmp_CV X2WeaponTemplate]
FriendlyName="基础灵能增幅器"
FriendlyNamePlural="基础灵能增幅器"
BriefSummary="这个版本的灵能增幅器可以引导使用者的灵能，使使用者能施展灵能力量。更高级的灵能增幅器可以增加使用者的灵能力量和他们能力的效果。灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能。"
TacticalText="<Bullet/> 灵能增幅器允许使用者施展他们的灵能能力\n<Bullet/> 更高级的灵能增幅器可以增加使用者的灵能力量和某些技能的效果</br><Bullet> 灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能。"
AbilityDescName="灵能增幅器"

[PsiAmp_MG X2WeaponTemplate]
FriendlyName="高级灵能增幅器"
FriendlyNamePlural="高级灵能增幅器"
BriefSummary="这个更先进的灵能增幅器能更清晰地引导使用者的灵能，使使用者拥有更强的灵能力量。携带高级灵能增幅器时，某些技能的灵能力量将得到提高</br><Bullet> 灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能"
TacticalText="<Bullet/> 高级灵能增幅器会提升使用者的灵能力量\n<Bullet/> 灵能力量决定了许多灵能能力的效果\n<Bullet/> 高级灵能增幅器还会提高很多灵能攻击的伤害</br><Bullet> 灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能。"
AbilityDescName="灵能增幅器"

[PsiAmp_BM X2WeaponTemplate]
FriendlyName="外星灵能增幅器"
FriendlyNamePlural="外星灵能增幅器"
BriefSummary="这个更先进的灵能增幅器使用了我们遇到的强大的“看门人”身上的东西。它将使我们富有经验的使用者的灵能水平提升到与外星人最强大的灵能力量比肩</br><Bullet> 灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能"
TacticalText="<Bullet/> 外星灵能增幅器可以提升使用者的灵能力量\n<Bullet/> 灵能力量决定了许多灵能能力的效果<Bullet/> 外星灵能增幅器还会提高很多灵能攻击的伤害</br><Bullet> 灵能增幅器本身提供不了什么，只是让使用者能操控灵能力量。使用者需要额外的灵能石来充分释放自己的专注力与潜能。"
AbilityDescName="灵能增幅器"

;========================================================
;   ADJUSTMENTS TO BASE GAME PERK DESCRIPTIONS
;========================================================

[TargetDefinition X2AbilityTemplate]
LocFriendlyName="目标明确"
LocLongDescription="任何被 <Ability:ClassName/> 看到的单位都将永远保持可见"
LocHelpText="任何被 <Ability:ClassName/> 看到的单位都将永远保持可见"
LocPromotionPopupText="<Bullet/> 被 <Ability:ClassName/> 侦察到的敌人即使在战争迷雾中也依然可见<br/>"

[TargetDefinitionPassive X2AbilityTemplate]
LocFriendlyName="目标明确"
LocLongDescription="任何被 <Ability:ClassName/> 看到的单位都将永远保持可见"
LocHelpText="任何被 <Ability:ClassName/> 看到的单位都将永远保持可见"

[PaleHorse X2AbilityTemplate]
LocFriendlyName="灵魂收割"
LocLongDescription="击杀会提升 <Ability:SOULHARVESTCRIT/> 暴击率，最高可达 <Ability:SOULHARVESTMAX/>"
LocHelpText="击杀会提升 <Ability:SOULHARVESTCRIT/> 暴击率，最高可达 <Ability:SOULHARVESTMAX/>"
LocFlyoverText="灵魂收割"
+LocPromotionPopupText="<Bullet/>只适用于突击步枪，霰弹枪，加农炮，狙击步枪，斗牛犬步枪，维克托步枪或者Spark步枪的攻击<br/>"

[Fuse X2AbilityTemplate]
LocFriendlyName="导火线"
LocLongDescription="如果敌人携带着爆炸物，灵能士兵可以将其远程引爆\n导火线的冷却时间基于灵能增幅器的等级"
LocHelpText="如果敌人携带着爆炸物，灵能士兵可以将其远程引爆\n导火线的冷却时间基于灵能增幅器的等级"
LocFlyOverText="导火线"
LocPromotionPopupText="<Bullet/> 导火线的冷却时间基于灵能增幅器的等级"

[Soulfire X2AbilityTemplate]
LocFriendlyName="灵魂火"
LocLongDescription="对有机体的敌人造成直接灵能伤害。无视掩护和护甲。"
LocHelpText="对有机体的敌人造成直接灵能伤害。无视掩护和护甲。"
LocFlyOverText="灵魂火"
LocPromotionPopupText="<Bullet/>灵魂火<Ability:SelfCooldown/>回合冷却。<br/><Bullet/>灵魂火的伤害可以通过改进<Ability:ClassName/>的灵能增幅器来提高。<br/><Bullet/>机器人和机械敌人完全免疫灵魂火。<br/>"

[SoulSteal X2AbilityTemplate]
LocFriendlyName="灵魂偷取"
LocLongDescription="灵魂火伤害的一半恢复<Ability:ClassName/>的生命值。"
LocHelpText="灵魂火伤害的一半恢复<Ability:ClassName/>的生命值。"
LocFlyOverText="灵魂偷取"
LocPromotionPopupText="<Bullet/>灵魂偷窃只能补充失去的生命值，不能增加<Ability:ClassName/>的最大生命值。<br/>"

[SoulStealTriggered X2AbilityTemplate]
LocFriendlyName="灵魂偷取"
LocLongDescription="灵魂火伤害的一半恢复<Ability:ClassName/>的生命值。"
LocHelpText="灵魂火伤害的一半恢复<Ability:ClassName/>的生命值。"
LocFlyOverText="灵魂偷取"
LocPromotionPopupText=""

[Insanity X2AbilityTemplate]
LocFriendlyName="错乱"
LocLongDescription="削弱意志的心灵攻击，能对敌人造成诸多负面效果，包括对目标的心灵控制。"
LocHelpText="削弱意志的心灵攻击，能对敌人造成诸多负面效果，包括对目标的心灵控制。"
LocFlyOverText="错乱"
LocMissMessage="错乱失败"
LocPromotionPopupText="<Bullet/>错乱<Ability:SelfCooldown/>回合冷却。<br/><Bullet/>错乱需要<Ability:ClassName/>的灵能强度属性和目标的意志力之间进行较量。<br/><子弹/>错乱可以使目标混乱、眩晕或心灵控制。机械敌人完全免疫错乱。<br/>"

[Inspire X2AbilityTemplate]
LocFriendlyName="鼓舞"
LocLongDescription="立刻给一名临近的队友提供一次额外行动机会。"
LocHelpText="立刻给一名临近的队友提供一次额外行动机会。"
LocFlyOverText="鼓舞"
LocPromotionPopupText="<Bullet/> Inspire has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Squadmates must be within the <Ability:ClassName/>'s sight radius, but line of sight is not required.<br/>"

[Solace X2AbilityTemplate]
LocFriendlyName="安慰"
LocLongDescription="<Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocHelpText="<Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocFlyOverText="安慰"
LocPromotionPopupText="<Bullet/>安慰有4格半径范围。<br/><Bullet/>移动到受折磨的盟友旁边将立即清除他们的精神损伤。<br/>"

[SolaceCleanse X2AbilityTemplate]
LocFriendlyName="安慰"
LocLongDescription="<Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocHelpText="<Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocFlyOverText="安慰"
LocPromotionPopupText="<Bullet/>安慰有4格半径范围。<br/><Bullet/>移动到受折磨的盟友旁边将立即清除他们的精神损伤。<br/>"

[SolacePassive X2AbilityTemplate]
LocFriendlyName="安慰"
LocLongDescription="Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocHelpText="Ability:ClassName/>现在被一个光环包围，能够立刻消除或阻止任何对灵能士兵和附近队友的精神损害。"
LocFlyOverText="安慰"
LocPromotionPopupText="<Bullet/>安慰有4格半径范围。<br/><Bullet/>移动到受折磨的盟友旁边将立即清除他们的精神损伤。<br/>"

[NullLance X2AbilityTemplate]
LocFriendlyName="虚空之矛"
LocLongDescription="发射一束可怕的能量，摧毁它所经过的每一个目标。这种攻击可以穿透多个敌人和障碍物。"
LocHelpText="发射一束可怕的能量，摧毁它所经过的每一个目标。这种攻击可以穿透多个敌人和障碍物。"
LocFlyOverText="虚空之矛"
LocPromotionPopupText="<Bullet/>虚空之矛<Ability:SelfCooldown/>回合冷却.<br/><Bullet/>虚空之矛的伤害可以通过改进<Ability:ClassName/>的灵能增幅器来提高。<br/>"

[Domination X2AbilityTemplate]
LocFriendlyName="支配"
LocLongDescription="永久对一名敌人心灵控制。一次任务只能成功进行一次支配。"
LocHelpText="永久对一名敌人心灵控制。一次任务只能成功进行一次支配。"
LocFlyOverText="支配"
LocMissMessage="支配失败"
LocPromotionPopupText="<Bullet/>支配需要<Ability:ClassName/>的灵能强度属性和目标的意志力之间进行较量。<br/><Bullet/>如果一次支配尝试失败，进行下一次尝试的冷却时间为4个回合.<br/><Bullet/>如果<Ability:ClassName/>死亡或离开战场，则支配会被打破。<br/>"

[PsiOperativeMindControl X2AbilityTemplate]
LocFriendlyName="心灵控制"
LocLongDescription="<Ability:ClassName/>可以主动控制目标的思想，迫使他们背叛同伴。"
LocHelpText="主动控制目标的思想"
LocFlyOverText="心灵控制"

;========================================================
;   NEW ITEMS - PSI PCS AND GEMS
;========================================================

;PCS and GEMS now dynamically copy their attached ability texts and promotion popup text and any pre-req abilities, eg soulfire + soulsteal

[InertMeld X2ItemTemplate]
FriendlyName="<font color = '#b6b3e3'>结晶化的原石</font>"
FriendlyNamePlural="<font color = '#b6b3e3'>结晶化的原石</font>"
BriefSummary="一团已经结晶化，处于惰性状态的原石。变种人军队似乎得到了回收一切这种物质的指示。\n我们的第一个样本现在在泰根博士的实验室里当镇纸"
TacticalText="一团已经结晶化，处于惰性状态的原石。变种人军队似乎得到了回收一切这种物质的指示。\n我们的第一个样本现在在泰根博士的实验室里当镇纸"
TinySummary="<font color = '#b6b3e3'>结晶化的原石</font>"
LootTooltip="一团已经结晶化，处于惰性状态的原石"
;;Shows up in the resources bar with the below name
AbilityDescName = "<font color = '#b6b3e3'>原石</font>"

;========================================================
;   NEW ABILITIES - FOR THE COMBAT INTELLIGENCE GRADING
;========================================================

;Actually used for abilities that could not be converted
[PexM_Meld X2AbilityTemplate]
LocFriendlyName="结晶化的原石"
LocLongDescription="一团已经结晶化，处于惰性状态的原石"
LocHelpText="一团已经结晶化，处于惰性状态的原石"
LocPromotionPopupText="一团已经结晶化，处于惰性状态的原石"
LootTooltip="一团已经结晶化，处于惰性状态的原石"
LocFlyOverText=""

;Actually used as a default for users to be able to easily add Will Negation to classes/rpgo specs etc
[PexM_WillNegation X2AbilityTemplate]
LocFriendlyName="灵能堡垒"
LocLongDescription="该单位拥有如此清醒的精神面貌，使用灵能并不是一种消耗精神的练习。"
LocHelpText="该单位拥有如此清醒的精神面貌，使用灵能并不是一种消耗精神的练习。"
LocPromotionPopupText="该单位拥有如此清醒的精神面貌，使用灵能并不是一种消耗精神的练习。"
LootTooltip=""
LocFlyOverText=""

;ACTIVE ABILITIES
[PexM_SyphonWill X2AbilityTemplate]
LocFriendlyName="心灵虹吸"
LocLongDescription="这个基本的灵能能力允许单位转移意志力。这是目标和释放者之间的一种共生转移。\n最大意志力的 <Ability:PexMSyphonWillMin/>% 到 <Ability:PexMSyphonWillMax/>% 会被吸取。此能力的冷却时间基于灵能增幅器的等级"
LocPromotionPopupText="这个基本的灵能能力允许单位转移意志力。<br/>这是目标和释放者之间的一种共生转移。<br/>最大意志力的 <Ability:PexMSyphonWillMin/>% 到 <Ability:PexMSyphonWillMax/>% 会被吸取。此能力的冷却时间基于灵能增幅器的等级"
LocHelpText="这个基本的灵能能力允许单位转移意志力。\n最大意志力的 <Ability:PexMSyphonWillMin/>% 到 <Ability:PexMSyphonWillMax/>% 会被吸取。"

[RapidPsionics_STD X2AbilityTemplate]
LocFriendlyName="心灵专注"
LocLongDescription="<Ability:ClassName/>能力被用来控制他们的灵能力量。可以免费使用一个灵能技能，并且返还所有灵能技能的冷却，充能以及消耗，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocPromotionPopupText="<Ability:ClassName/> 能力经过了坚实的训练，以帮助他们控制自己的灵能力量。通过冥想，他们可以清理自己的头脑，重新聚焦他们的灵能力量，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocHelpText="重新聚焦单位的灵能力量。下一个灵能技能免费使用\n消除异常精神状态，但会导致轻微昏迷\n必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocFlyOverText="神之降临：标准"

[RapidPsionics_AVG X2AbilityTemplate]
LocFriendlyName="心灵专注"
LocLongDescription="<Ability:ClassName/>能力被用来控制他们的灵能力量。可以免费使用一个灵能技能，并且返还所有灵能技能的冷却，充能以及消耗，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocPromotionPopupText="<Ability:ClassName/> 能力经过了坚实的训练，以帮助他们控制自己的灵能力量。通过冥想，他们可以清理自己的头脑，重新聚焦他们的灵能力量，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocHelpText="重新聚焦单位的灵能力量。下一个灵能技能免费使用\n消除异常精神状态，但会导致轻微昏迷\n必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocFlyOverText="神之降临：平均"

[RapidPsionics_GIF X2AbilityTemplate]
LocFriendlyName="心灵专注"
LocLongDescription="<Ability:ClassName/>能力被用来控制他们的灵能力量。可以免费使用一个灵能技能，并且返还所有灵能技能的冷却，充能以及消耗，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocPromotionPopupText="<Ability:ClassName/> 能力经过了坚实的训练，以帮助他们控制自己的灵能力量。通过冥想，他们可以清理自己的头脑，重新聚焦他们的灵能力量，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocHelpText="重新聚焦单位的灵能力量。下一个灵能技能免费使用\n消除异常精神状态，但会导致轻微昏迷\n必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocFlyOverText="神之降临：有天赋"

[RapidPsionics_GEN X2AbilityTemplate]
LocFriendlyName="心灵专注"
LocLongDescription="<Ability:ClassName/>能力被用来控制他们的灵能力量。可以免费使用一个灵能技能，并且返还所有灵能技能的冷却，充能以及消耗，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocPromotionPopupText="<Ability:ClassName/> 能力经过了坚实的训练，以帮助他们控制自己的灵能力量。通过冥想，他们可以清理自己的头脑，重新聚焦他们的灵能力量，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocHelpText="重新聚焦单位的灵能力量。下一个灵能技能免费使用\n消除异常精神状态，但会导致轻微昏迷\n必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocFlyOverText="神之降临：天才"

[RapidPsionics_SAV X2AbilityTemplate]
LocFriendlyName="心灵专注"
LocLongDescription="<Ability:ClassName/>能力被用来控制他们的灵能力量。可以免费使用一个灵能技能，并且返还所有灵能技能的冷却，充能以及消耗，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocPromotionPopupText="<Ability:ClassName/> 能力经过了坚实的训练，以帮助他们控制自己的灵能力量。通过冥想，他们可以清理自己的头脑，重新聚焦他们的灵能力量，消除异常精神状态。必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocHelpText="重新聚焦单位的灵能力量。下一个灵能技能免费使用\n消除异常精神状态，但会导致轻微昏迷\n必须在做任何其他事情之前使用，但这是一个免费操作。\n恢复<Ability:PexMClarityWillMin/>% 到 <Ability:PexMClarityWillMax/>%的最大意志力"
LocFlyOverText="神之降临：学者"

;PASSIVE ABILITIES
[PexM_TestBoost_Std X2AbilityTemplate]
LocFriendlyName="一级灵能"
LocLongDescription="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力。如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"
LocPromotionPopupText="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力</br><Bullet> 这种提升体现在可以快速重新聚集他们的灵能潜力 </br><Bullet> 如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"

[PexM_TestBoost_Avg X2AbilityTemplate]
LocFriendlyName="二级灵能"
LocLongDescription="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力。如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"
LocPromotionPopupText="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力</br><Bullet> 这种提升体现在可以快速重新聚集他们的灵能潜力 </br><Bullet> 如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"

[PexM_TestBoost_Gif X2AbilityTemplate]
LocFriendlyName="三级灵能"
LocLongDescription="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力。如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"
LocPromotionPopupText="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力</br><Bullet> 这种提升体现在可以快速重新聚集他们的灵能潜力 </br><Bullet> 如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"

[PexM_TestBoost_Gen X2AbilityTemplate]
LocFriendlyName="四级灵能"
LocLongDescription="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力。如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"
LocPromotionPopupText="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力</br><Bullet> 这种提升体现在可以快速重新聚集他们的灵能潜力 </br><Bullet> 如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"

[PexM_TestBoost_Sav X2AbilityTemplate]
LocFriendlyName="五级灵能"
LocLongDescription="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力。如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"
LocPromotionPopupText="这位 <Ability:ClassName/> 已经通过了灵能训练并释放了他的灵能潜力，获得灵能力量的提升。这种提升体现在可以快速重新聚集他们的灵能潜力</br><Bullet> 这种提升体现在可以快速重新聚集他们的灵能潜力 </br><Bullet> 如果他们的职业本身允许使用远程主要武器（不包括手枪），并且XCOM可以提供，他们就可以使用灵能步枪"

;Used for errors in ability gifted by combat intelligence
[PexM_TestBoost_Err X2AbilityTemplate]
LocFriendlyName="<font color = '#6A1616'> ! 错误 ! </font>"
LocLongDescription="<font color = '#6A1616'> ! 错误 ! </font>\n发生了问题，请与Mod作者联系，并提供导致此BUG的事件描述、launch.log和屏幕截图。\n"<font color = '#6A1616'> ! ERROR ! </font>"
LocHelpText="<font color = '#6A1616'> ! ERROR ! </font>\n发生了问题，请与Mod作者联系，并提供导致此BUG的事件描述、launch.log和屏幕截图。\n"<font color = '#6A1616'> ! ERROR ! </font>"
LocPromotionPopupText="<font color = '#6A1616'> ! ERROR ! </font>\n发生了问题，请与Mod作者联系，并提供导致此BUG的事件描述、launch.log和屏幕截图。\n"<font color = '#6A1616'> ! ERROR ! </font>"
LootTooltip="<font color = '#6A1616'> ! 错误 ! </font>"
LocFlyOverText="<font color = '#6A1616'> ! 错误 ! </font>"

;========================================================
;   NEW 'PEXM CHAMBER' TECHS
;========================================================

[Tech_PexM_PCS X2TechTemplate]
DisplayName="个人战斗芯片：灵能构造"
Summary="通过处理这种源自外星人入侵带来的结晶化原石，我们发现它可以作为灵能能量的导体。我们可以试着激活这些活性宝石状原石—或者说—灵能石的潜在特性。其中一些会变得高度不稳定，但如果我们把它们集成进个人的战斗模块中，我们就能创造稳定的灵能战斗模块。虽然很难预测会发生什么。\n- 泰根"

[Tech_PexM_PCS_PRIEST X2TechTemplate]
DisplayName="个人战斗芯片：灵能刺激"
Summary="得益于与头颅开采器相关的新技术，我们可以从这名变种人牧师单位的尸体中提取稳定的灵能战斗刺激剂。尽管对于XCOM来说，什么可以被称为稳定还是个随机猜测。 \n- 沈"

[Tech_PexM_GEMS X2TechTemplate]
DisplayName="灵能石"
Summary="通过处理这种源自外星人入侵带来的结晶化原石，我们发现它可以作为灵能能量的导体。我们可以试着激活这些活性宝石状原石—或者说—灵能石的潜在特性。虽然很难预测会发生什么。\n- 泰根"

[Tech_PexM_CONVERT X2TechTemplate]
DisplayName="原石提取"
Summary="指挥官，我想我们已经发现了变种人派灭绝小队进入失落城市的真正原因了。看起来他们正在收获结晶化的原石，这些原石已经融合进了在空投舱附近度过了很长时间的居民和生物的身体里。如果你能收集到足够多的尸体，我们就能提取一些供我们自己使用。\n- 泰根"
UnlockedDescription="提取 <XGParam:StrValue0/!Quantity/> 原石"

[Tech_PexM_Amps_Advanced X2TechTemplate]
DisplayName="高级灵能研究"
Summary="我们可以深入研究变种人祭司使用的灵能增幅器了。这让沈能够通过优化能源管理方法来制造更先进的灵能增幅器。这些先进的技术将使灵能增幅器搭载更多灵能石，进一步增强灵能力量。\n- 泰根"

[Tech_PexM_Amps_Alien X2TechTemplate]
DisplayName="虚灵级灵能研究"
Summary="我们可以深入研究看门人外壳的灵能导管了。这让沈能够通过改进能源结构方法来制造更强大的“外星”增幅器。这些强大的技术将使灵能增幅器搭载更多灵能石，进一步增强灵能力量。 \n- 泰根"

;========================================================
;   NEW FACILITY STUFFS - SEE ALSO MOD.INT
;========================================================

[PexMChamber X2FacilityTemplate]
DisplayName="灵能实验室"
CompletedSummary="我们现在有一个专门进行灵能实验的地方了。新员工槽位可用—灵能实验室"
Summary="这个灵能实验室将允许你制造强大的灵能装备。我们的士兵可以在标准训练的基础上，进行一次高强度的精神考验，以调整他们对灵能的掌控力。"
CantBeRemovedText="有项目正在进行中"

[PexMChamber_SecondCell X2FacilityUpgradeTemplate]
DisplayName="优化工作区"
FacilityName="灵能实验室"
Summary="灵能实验室增加一个区域，为工作人员提供额外的空间来专注于制作灵能装备。"

[PexMChamber_TrainingCell X2FacilityUpgradeTemplate]
DisplayName="灵能吸收室"
FacilityName="灵能实验室"
Summary="灵能实验室增加一个区域，为士兵提供额外的空间来训练他们的灵能潜能，并提升与他们的天赋相匹配的灵能力量，也可以让他们装备任何我们开发的独特的灵能武器。"

[PexMChamberStaffSlot_Sci X2StaffSlotTemplate]
EmptyText="开放：需要科学家"
BonusEmptyText="缩短灵能项目时间"
BonusText="项目时间 -%AVENGERBONUS%"
FilledText="%UNITNAME 的灵能科学研究正在提高我们开展灵能项目的速度！"
LockedText="锁定：需要购买升级"

[PexMChamberStaffSlot_Eng X2StaffSlotTemplate]
EmptyText="开放：需要工程师"
BonusEmptyText="缩短灵能项目时间"
BonusText="项目时间 -%AVENGERBONUS%"
FilledText="%UNITNAME 的灵能工程学知识正在提高我们开展灵能项目的速度！"
LockedText="锁定：需要购买升级"

[PexMChamberStaffSlot_Sol X2StaffSlotTemplate]
EmptyText="开放：需要士兵"
BonusEmptyText="正在训练：灵能力量"
BonusText="正在训练：灵能力量"
FilledText="%UNITNAME 正在进行高强度的灵能训练"
LockedText="锁定：需要购买升级"

;========================================================
;   NEW BREAKTHROUGH TECHS
;========================================================

[BreakthroughPsiAmpWeaponUpgrade X2TechTemplate]
DisplayName="模块化灵能增幅器"
Summary="重新设计的灵能增幅器框架系统允许我们插入一个额外的灵能石升级槽。"

[BreakthroughPexMChamberCostReduction X2TechTemplate]
DisplayName="灵能设施建设"
Summary="我们已经改进了对不稳定灵能能量的约束技术，灵能实验室的建造成本降低 %VALUE%"

[BreakthroughPexMChamberSecondCellCostReduction X2TechTemplate]
DisplayName="优化工作区建设"
Summary="有了专门的时间和设备，我们可以以较低的成本清理灵能实验室后面区域，优化工作区的成本降低 %VALUE%"

[BreakthroughPexMChamberTrainingCellCostReduction X2TechTemplate]
DisplayName="灵能吸收室建设"
Summary="有了专门的时间和设备，我们可以以较低的成本清理灵能实验室侧面区域，灵能吸收室的成本降低 %VALUE%"

;========================================================
;   NEW POI FOR MELD
;========================================================

[Reward_Meld X2RewardTemplate]
DisplayName="结晶化的原石"
RewardDetails="我们在一个生锈的旧容器里发现了一堆原石。不知道为什么会出现在这里"

[POI_Meld X2PointOfInterestTemplate]
DisplayNames[0]="结晶化的原石"
DisplayNames[1]="结晶化的原石"
DisplayNames[2]="结晶化的原石"

CompletedSummaries[0]="我们在这儿发现了一些原石"
CompletedSummaries[1]="我们在这儿发现了一些原石"
CompletedSummaries[2]="我们在这儿发现了一些原石"

POIImages[0]="img:///UILibrary_StrategyImages.X2StrategyMap.POI_DeadAdvent"
POIImages[1]="img:///UILibrary_StrategyImages.X2StrategyMap.POI_StolenGoods"
POIImages[2]="img:///UILibrary_StrategyImages.X2StrategyMap.POI_Bonfire"

;========================================================
;   NEW COVERT ACTION FOR MELD 
;========================================================

[Reward_StatBoostPEXM X2RewardTemplate]
DisplayName="改进灵能攻击"
RewardDetails="改进灵能攻击"

[StatBoost_PEXM X2EquipmentTemplate]
FriendlyName="灵能攻击"

[CovertAction_GatherMeld X2CovertActionTemplate]
ActionObjective="收集原石"

[CovertAction_GatherMeld_Narrative_Skirmishers X2CovertActionNarrativeTemplate]
ActionName="原石收藏"
ActionPreNarrative="我的族人仍然记得为长老们服务的时光。有了这些知识，我们也许能收集到一些原石，但如果想成功，我们需要你的帮助。"
ActionPostNarrative="我们已经了解了很多关于收集这种物质的方法"

[CovertAction_GatherMeld_Narrative_Reapers X2CovertActionNarrativeTemplate]
ActionName="原石收藏"
ActionPreNarrative="除了其他方面，我的人对有价值的信息也很有嗅觉。如果你能提供一点火力支援，我们也许能找到有用的线索。无论我们找到什么，我们都会与你分享。"
ActionPostNarrative="我说的没错吧，外星人什么都瞒不过我们。"

[CovertAction_GatherMeld_Narrative_Templars X2CovertActionNarrativeTemplate]
ActionName="原石收藏"
ActionPreNarrative="我的追随者相信我们可以从变种人那里得到有价值的信息，但我们需要你的帮助。我们将一起了解他们对我们所隐瞒的一切!"
ActionPostNarrative="正如我们所猜测的那样，他们无法保护自己的思想不受圣殿骑士的影响。"

;========================================================
;   NEW OTHER STUFF 
;========================================================

[XComGame.UIInventory]
[UIInventory_PexM]
m_strTitle=灵能库存
m_strInventoryLabel=灵能库存
m_strTitleBig=灵能库存
m_strNoLoot=无可用灵能

;changing the name in case of Psionics Overhaul v3 integration by allowing the psi lab ?!?
[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_PsiAmp]=灵能

[XComGame.UIAlert]
[UIAlert]
-m_strNegativeTraitAcquiredTitle=获得负面特质
-m_strPositiveTraitAcquiredTitle=获得正面特质

+m_strNegativeTraitAcquiredTitle=获得新特质
+m_strPositiveTraitAcquiredTitle=获得新特质

[XComGame.XGLocalizedData]
[XGLocalizedData]
-TraitAcquiredFormatString="<XGParam:StrValue0/!UnitName/> 获得了负面特质—— <XGParam:StrValue1/!TraitName/>."
+TraitAcquiredFormatString="<XGParam:StrValue0/!UnitName/> 获得了新特质—— <XGParam:StrValue1/!TraitName/>."

;========================================================
;   - ENCYLOPEDIA -
;========================================================

;XcomEnclopedia.ini
;+-EncyclopediaNames    // [thispart X2EncyclopediaTemplate]
;ListCategory;		    // Internal name of the category to which this header/entry belong to
;bCategoryHeader;	    // If true, this entry functions as a category header; if false, this entry functions as a regular entry.
;SortingPriority;	    // The priority of this entry relative to others in the same category (lower priority sorts higher in the list).
;Requirements;		    // Requirements to show up in the archive
;ListImagePath;		    // The URL to the image that should be displayed as part of the list entry if this is a header.
;DescriptionImagePath;  // The URL to the image that should be displayed as part of the list entry if this is not a header.

;this file
;ListTitle;			 // Player facing name of this entry/header.
;DescriptionTitle;   // Player facing description title that appears when selected.
;DescriptionEntry;   // Player facing description body that appears when selected.

[Header_FACILITYDATA X2EncyclopediaTemplate]
[PexMChamber_Facility X2EncyclopediaTemplate]
ListTitle="灵能实验室"
DescriptionTitle="灵能实验室"
DescriptionEntry="为XCOM特工提供灵能训练。这个灵能实验室使你能创造强大的灵能装备。我们的士兵能以高强的的精神考验代替标准的士兵训练，从而释放他们的灵能潜力。\n\n虽然我们曾见过他们使用灵能，但我们最近与外星人的接触才真正向我们展示了他们如何巧妙地操纵灵能力量，并将其转化为自己的优势。如果我们能像他们一样掌握它，这个领域的潜在应用将是无限的。我们需要更多的实验。"

[Header_PEXM X2EncyclopediaTemplate]
ListTitle="灵能实验室"

[InertMeld X2EncyclopediaTemplate]
ListTitle="<font color = '#b6b3e3'>结晶化的原石</font>"
DescriptionTitle="<font color = '#b6b3e3'>结晶化的原石</font>"
DescriptionEntry="一团已经结晶化，处于惰性状态的原石。变种人军队似乎得到了回收一切这种物质的指示。\n\n我们的第一个样本现在在泰根博士的实验室里当镇纸。"

[PexMMana X2EncyclopediaTemplate]
ListTitle="心灵力量提取"
DescriptionTitle="心灵力量提取"
DescriptionEntry="心灵力量提取系统是 <VALUEBOOL/>.<br/><br/>&nbsp; 灵能对我们的单位来说是一种非常强大的力量。对于大多数使用者来说，这需要极强的心灵能量。这意味着使用者会消耗 <font color='#3CEDD4'>意志力</font>.\n\n使用者的 <font color='#3CEDD4'>意志力</font> 被转换成 <font color='#3CEDD4'>灵能</font> 以释放他们的灵能能力。每次使用灵能技能消耗 <VALUEMIN/><VALUEMAX/> <font color='#3CEDD4'>意志力</font>，一些灵能技能的最大消耗会多几倍。\n\n&nbsp;我们大部分灵能增幅器科技都可以通过心灵虹吸来补充<font color='#3CEDD4'>意志力/灵能</font>。让我们的士兵保持最佳状态应该有助于防止疲劳或动摇。<br/><br/>&nbsp; 不是所有灵能技能都会消耗 <font color='#3CEDD4'>意志力/灵能</font>。这将由指挥官来亲自探寻、牢记、规划与记录。<br/><br/>以下职业免疫<font color='#3CEDD4'>意志力/灵能</font>吸取<CLASSES/><br/>以下技能<font color='#3CEDD4'>意志力/灵能</font>吸取无效：<PERKS/>"

[PexMChamber X2EncyclopediaTemplate]
ListTitle="灵能实验室"
DescriptionTitle="灵能实验室"
DescriptionEntry="为XCOM特工提供灵能训练。这个灵能实验室使你能创造强大的灵能装备。我们的士兵能以高强的的精神考验代替标准的士兵训练，从而释放他们的灵能潜力。\n\n虽然我们曾见过他们使用灵能，但我们最近与外星人的接触才真正向我们展示了他们如何巧妙地操纵灵能力量，并将其转化为自己的优势。如果我们能像他们一样掌握它，这个领域的潜在应用将是无限的。我们需要更多的实验。"
